In [1]:
import pandas as pd

In [2]:
chicago = pd.read_csv("chicago.csv")
newyork = pd.read_csv("new_york_city.csv")
washington = pd.read_csv("washington.csv")

In [3]:
Data = [chicago, newyork, washington]
Dataname = ['chicago', 'newyork', 'washington']

In [4]:
for data, dataname in zip(Data, Dataname):
    print(f'Shape for {str(dataname)} is {data.shape}')

Shape for chicago is (300000, 9)
Shape for newyork is (300000, 9)
Shape for washington is (300000, 7)

In [5]:
for data, dataname in zip(Data, Dataname):
    print(f'The Null Values for {str(dataname)} is \n{data.isna().sum()}')
    print('---------------------------------')

The Null Values for chicago is
Unnamed: 0           0
Start Time           0
End Time             0
Trip Duration        0
Start Station        0
End Station          0
User Type            0
Gender           61052
Birth Year       61019
dtype: int64
---------------------------------
The Null Values for newyork is
Unnamed: 0           0
Start Time           0
End Time             0
Trip Duration        0
Start Station        0
End Station          0
User Type          692
Gender           29209
Birth Year       28220
dtype: int64
---------------------------------
The Null Values for washington is
Unnamed: 0       0
Start Time       0
End Time         0
Trip Duration    0
Start Station    0
End Station      0
User Type        0
dtype: int64
---------------------------------

In [6]:
# [0] = chicago, [1] = newyork, [2] = washington
# convert columns name from uper to lower
# Rename first column to (id)

Data[0].rename(columns=str.lower, inplace=True)
Data[0].rename(columns={'unnamed: 0':'id'}, inplace=True)

Data[1].rename(columns=str.lower, inplace=True)
Data[1].rename(columns={'unnamed: 0':'id'}, inplace=True)

Data[2].rename(columns=str.lower, inplace=True)
Data[2].rename(columns={'unnamed: 0':'id'}, inplace=True)

print(f"DF Chicago:\n {list(Data[0])}")
print("-----------")
print(f"DF Newyork:\n {list(Data[1])}")
print("-----------")
print(f"DF Washington:\n {list(Data[2])}")

DF Chicago:
 ['id', 'start time', 'end time', 'trip duration', 'start station', 'end station', 'user type', 'gender', 'birth year']
-----------
DF Newyork:
 ['id', 'start time', 'end time', 'trip duration', 'start station', 'end station', 'user type', 'gender', 'birth year']
-----------
DF Washington:
 ['id', 'start time', 'end time', 'trip duration', 'start station', 'end station', 'user type']

In [7]:
# T is Transpose for make columns rows and vice versa
Data[0].describe().T

,count,mean,std,min,25%,50%,75%,max
id,300000.0,776345.813277,448146.363046,4.0,387136.75,777103.5,1164065.25,1551500.0
trip duration,300000.0,936.239290,1548.792767,60.0,393.00,670.0,1125.00,86224.0
birth year,238981.0,1980.858223,11.003329,1899.0,1975.00,1984.0,1989.00,2016.0

In [8]:
Data[1].describe().T

,count,mean,std,min,25%,50%,75%,max
id,300000.0,3.407026e+06,1.965617e+06,33.0,1707416.25,3405756.0,5108761.5,6816152.0
trip duration,300000.0,8.996842e+02,5.710016e+03,61.0,368.00,609.0,1054.0,2155775.0
birth year,271780.0,1.978254e+03,1.184804e+01,1885.0,1970.00,1981.0,1988.0,2001.0

In [9]:
Data[2].describe().T

,count,mean,std,min,25%,50%,75%,max
id,300000.0,875404.389300,505933.462622,7.00,436393.750,875063.5000,1.313148e+06,1751446.00
trip duration,300000.0,1237.279952,5461.996571,60.01,410.623,706.5015,1.229427e+03,1235662.17

In [10]:
chicago.head()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year
0,1423854,6/23/2017 15:09,6/23/2017 15:14,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0
1,955915,5/25/2017 18:19,5/25/2017 18:45,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
2,9031,1/4/2017 8:27,1/4/2017 8:34,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0
3,304487,3/6/2017 13:49,3/6/2017 13:55,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0
4,45207,1/17/2017 14:53,1/17/2017 15:02,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0

In [11]:
newyork.head()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year
0,5688089,6/11/2017 14:55,6/11/2017 15:08,795,Suffolk St & Stanton St,W Broadway & Spring St,Subscriber,Male,1998.0
1,4096714,5/11/2017 15:30,5/11/2017 15:41,692,Lexington Ave & E 63 St,1 Ave & E 78 St,Subscriber,Male,1981.0
2,2173887,3/29/2017 13:26,3/29/2017 13:48,1325,1 Pl & Clinton St,Henry St & Degraw St,Subscriber,Male,1987.0
3,3945638,5/8/2017 19:47,5/8/2017 19:59,703,Barrow St & Hudson St,W 20 St & 8 Ave,Subscriber,Female,1986.0
4,6208972,6/21/2017 7:49,6/21/2017 7:54,329,1 Ave & E 44 St,E 53 St & 3 Ave,Subscriber,Male,1992.0

In [12]:
washington.head()

,id,start time,end time,trip duration,start station,end station,user type
0,1621326,2017-06-21 08:36:34,2017-06-21 08:44:43,489.066,14th & Belmont St NW,15th & K St NW,Subscriber
1,482740,2017-03-11 10:40:00,2017-03-11 10:46:00,402.549,Yuma St & Tenley Circle NW,Connecticut Ave & Yuma St NW,Subscriber
2,1330037,2017-05-30 01:02:59,2017-05-30 01:13:37,637.251,17th St & Massachusetts Ave NW,5th & K St NW,Subscriber
3,665458,2017-04-02 07:48:35,2017-04-02 08:19:03,1827.341,Constitution Ave & 2nd St NW/DOL,M St & Pennsylvania Ave NW,Customer
4,1481135,2017-06-10 08:36:28,2017-06-10 09:02:17,1549.427,Henry Bacon Dr & Lincoln Memorial Circle NW,Maine Ave & 7th St SW,Subscriber

In [13]:
for data, dataname in zip(Data, Dataname):
    print(f'Info for {str(dataname)} is \n {data.info()}')
    print('---------------------------------')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  object
 2   end time       300000 non-null  object
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      300000 non-null  object
 7   gender         238948 non-null  object
 8   birth year     238981 non-null  float64
dtypes: float64(1), int64(2), object(6)
memory usage: 20.6+ MB
Info for chicago is
 None
---------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  object
 2   end time       300000 non-null  object
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      299308 non-null  object
 7   gender         270791 non-null  object
 8   birth year     271780 non-null  float64
dtypes: float64(1), int64(2), object(6)
memory usage: 20.6+ MB
Info for newyork is
 None
---------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  object
 2   end time       300000 non-null  object
 3   trip duration  300000 non-null  float64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      300000 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 16.0+ MB
Info for washington is
 None
---------------------------------

In [14]:
# Use DataFrame.apply() to convert multiple columns to datetime

for data, dataname in zip(Data, Dataname):
    data[['start time', 'end time']] = data[['start time', 'end time']].apply(pd.to_datetime, errors='coerce')             
    print(f"Convert {dataname} to datetime: \n{data.info()}")
    print("-----------------")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      300000 non-null  object
 7   gender         238948 non-null  object
 8   birth year     238981 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(4)
memory usage: 20.6+ MB
Convert chicago to datetime:
None
-----------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      299308 non-null  object
 7   gender         270791 non-null  object
 8   birth year     271780 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(4)
memory usage: 20.6+ MB
Convert newyork to datetime:
None
-----------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  float64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      300000 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 16.0+ MB
Convert washington to datetime:
None
-----------------

In [15]:
chicaBY = Data[0]['birth year'].isna().value_counts()
chicaGe = Data[0]['gender'].isna().value_counts()

print(chicaBY)
print("------------")
print(chicaGe)

print("\n*=*=*=*=*=*=*=*=*=*=*=*=*=*\n")

newyoBY = Data[1]['birth year'].isna().value_counts()
newyoGe = Data[1]['gender'].isna().value_counts()
newyoUT = Data[1]['user type'].isna().value_counts()

print(newyoBY)
print("------------")
print(newyoGe)
print("------------")
print(newyoUT)

#chicago.isna().sum()
#sum(chicago['birth year'].isnull())
#sum(Data[0]['birth year'].isnull())

False    238981
True      61019
Name: birth year, dtype: int64
------------
False    238948
True      61052
Name: gender, dtype: int64

*=*=*=*=*=*=*=*=*=*=*=*=*=*

False    271780
True      28220
Name: birth year, dtype: int64
------------
False    270791
True      29209
Name: gender, dtype: int64
------------
False    299308
True        692
Name: user type, dtype: int64

In [16]:
# extract hour, month, day of week and year from strat time to create new column

for data in Data:
    data['hour'] = data['start time'].dt.strftime('%H').astype(int)
    data['day'] = data['start time'].dt.day_name()
    data['month'] = data['start time'].dt.month_name()
    
    print(data.info())
    print("---------------------------")
    
    #data['year'] = pd.DatetimeIndex(data['start time']).year

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      300000 non-null  object
 7   gender         238948 non-null  object
 8   birth year     238981 non-null  float64
 9   hour           300000 non-null  int32
 10  day            300000 non-null  object
 11  month          300000 non-null  object
dtypes: datetime64[ns](2), float64(1), int32(1), int64(2), object(6)
memory usage: 26.3+ MB
None
---------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      299308 non-null  object
 7   gender         270791 non-null  object
 8   birth year     271780 non-null  float64
 9   hour           300000 non-null  int32
 10  day            300000 non-null  object
 11  month          300000 non-null  object
dtypes: datetime64[ns](2), float64(1), int32(1), int64(2), object(6)
memory usage: 26.3+ MB
None
---------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  float64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      300000 non-null  object
 7   hour           300000 non-null  int32
 8   day            300000 non-null  object
 9   month          300000 non-null  object
dtypes: datetime64[ns](2), float64(1), int32(1), int64(1), object(5)
memory usage: 21.7+ MB
None
---------------------------

In [17]:
chicago = Data[0]
chicago.head()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year,hour,day,month
0,1423854,2017-06-23 15:09:00,2017-06-23 15:14:00,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,15,Friday,June
1,955915,2017-05-25 18:19:00,2017-05-25 18:45:00,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,18,Thursday,May
2,9031,2017-01-04 08:27:00,2017-01-04 08:34:00,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,8,Wednesday,January
3,304487,2017-03-06 13:49:00,2017-03-06 13:55:00,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0,13,Monday,March
4,45207,2017-01-17 14:53:00,2017-01-17 15:02:00,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,14,Tuesday,January

In [18]:
newyork = Data[1]
newyork.head()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year,hour,day,month
0,5688089,2017-06-11 14:55:00,2017-06-11 15:08:00,795,Suffolk St & Stanton St,W Broadway & Spring St,Subscriber,Male,1998.0,14,Sunday,June
1,4096714,2017-05-11 15:30:00,2017-05-11 15:41:00,692,Lexington Ave & E 63 St,1 Ave & E 78 St,Subscriber,Male,1981.0,15,Thursday,May
2,2173887,2017-03-29 13:26:00,2017-03-29 13:48:00,1325,1 Pl & Clinton St,Henry St & Degraw St,Subscriber,Male,1987.0,13,Wednesday,March
3,3945638,2017-05-08 19:47:00,2017-05-08 19:59:00,703,Barrow St & Hudson St,W 20 St & 8 Ave,Subscriber,Female,1986.0,19,Monday,May
4,6208972,2017-06-21 07:49:00,2017-06-21 07:54:00,329,1 Ave & E 44 St,E 53 St & 3 Ave,Subscriber,Male,1992.0,7,Wednesday,June

In [19]:
washington = Data[2]
washington.head()

,id,start time,end time,trip duration,start station,end station,user type,hour,day,month
0,1621326,2017-06-21 08:36:34,2017-06-21 08:44:43,489.066,14th & Belmont St NW,15th & K St NW,Subscriber,8,Wednesday,June
1,482740,2017-03-11 10:40:00,2017-03-11 10:46:00,402.549,Yuma St & Tenley Circle NW,Connecticut Ave & Yuma St NW,Subscriber,10,Saturday,March
2,1330037,2017-05-30 01:02:59,2017-05-30 01:13:37,637.251,17th St & Massachusetts Ave NW,5th & K St NW,Subscriber,1,Tuesday,May
3,665458,2017-04-02 07:48:35,2017-04-02 08:19:03,1827.341,Constitution Ave & 2nd St NW/DOL,M St & Pennsylvania Ave NW,Customer,7,Sunday,April
4,1481135,2017-06-10 08:36:28,2017-06-10 09:02:17,1549.427,Henry Bacon Dr & Lincoln Memorial Circle NW,Maine Ave & 7th St SW,Subscriber,8,Saturday,June

In [20]:
chicago.head()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year,hour,day,month
0,1423854,2017-06-23 15:09:00,2017-06-23 15:14:00,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,15,Friday,June
1,955915,2017-05-25 18:19:00,2017-05-25 18:45:00,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,18,Thursday,May
2,9031,2017-01-04 08:27:00,2017-01-04 08:34:00,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,8,Wednesday,January
3,304487,2017-03-06 13:49:00,2017-03-06 13:55:00,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0,13,Monday,March
4,45207,2017-01-17 14:53:00,2017-01-17 15:02:00,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,14,Tuesday,January

In [21]:
newyork.head()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year,hour,day,month
0,5688089,2017-06-11 14:55:00,2017-06-11 15:08:00,795,Suffolk St & Stanton St,W Broadway & Spring St,Subscriber,Male,1998.0,14,Sunday,June
1,4096714,2017-05-11 15:30:00,2017-05-11 15:41:00,692,Lexington Ave & E 63 St,1 Ave & E 78 St,Subscriber,Male,1981.0,15,Thursday,May
2,2173887,2017-03-29 13:26:00,2017-03-29 13:48:00,1325,1 Pl & Clinton St,Henry St & Degraw St,Subscriber,Male,1987.0,13,Wednesday,March
3,3945638,2017-05-08 19:47:00,2017-05-08 19:59:00,703,Barrow St & Hudson St,W 20 St & 8 Ave,Subscriber,Female,1986.0,19,Monday,May
4,6208972,2017-06-21 07:49:00,2017-06-21 07:54:00,329,1 Ave & E 44 St,E 53 St & 3 Ave,Subscriber,Male,1992.0,7,Wednesday,June

In [22]:
chicago['birth year'].value_counts()

1989.0    14666
1988.0    12490
1991.0    12397
1990.0    12378
1987.0    11939
          ...
2003.0        2
1938.0        2
1909.0        2
2004.0        1
1931.0        1
Name: birth year, Length: 79, dtype: int64

In [23]:
chicago['birth year'].max()

2016.0

In [24]:
# we need to know the ratio to the whole data in chicago
chicagoBY = (61019 * 100) / 300000
chicagoBY

20.339666666666666

In [25]:
chicago.tail()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year,hour,day,month
299995,64825,2017-01-21 13:18:00,2017-01-21 13:27:00,590,Orleans St & Elm St (*),Sheffield Ave & Webster Ave,Subscriber,Male,1965.0,13,Saturday,January
299996,695993,2017-04-28 19:32:00,2017-04-28 19:51:00,1139,Ashland Ave & Blackhawk St,Clark St & Elm St,Customer,NaN,NaN,19,Friday,April
299997,159685,2017-02-12 09:59:00,2017-02-12 10:21:00,1368,Ravenswood Ave & Lawrence Ave,Stockton Dr & Wrightwood Ave,Subscriber,Female,1988.0,9,Sunday,February
299998,564681,2017-04-16 17:07:00,2017-04-16 17:19:00,705,Sheffield Ave & Willow St,Clark St & Chicago Ave,Customer,NaN,NaN,17,Sunday,April
299999,1021247,2017-05-30 12:38:00,2017-05-30 12:55:00,1028,Wacker Dr & Washington St,Damen Ave & Division St,Subscriber,Male,1984.0,12,Tuesday,May

In [26]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      300000 non-null  object
 7   gender         238948 non-null  object
 8   birth year     238981 non-null  float64
 9   hour           300000 non-null  int32
 10  day            300000 non-null  object
 11  month          300000 non-null  object
dtypes: datetime64[ns](2), float64(1), int32(1), int64(2), object(6)
memory usage: 26.3+ MB

In [27]:
newyork['birth year'].value_counts()

1989.0    11126
1985.0    11006
1986.0    10959
1988.0    10950
1987.0    10839
          ...
1918.0        1
1930.0        1
1907.0        1
1921.0        1
1888.0        1
Name: birth year, Length: 91, dtype: int64

In [28]:
newyork['birth year'].max()

2001.0

In [29]:
# we need to know the ratio to the whole data in chicago
newyorkBY = (28220 * 100) / 300000
newyorkBY

9.406666666666666

In [30]:
newyork.tail()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year,hour,day,month
299995,3273600,2017-04-24 17:51:00,2017-04-24 17:59:00,495,W 25 St & 6 Ave,W 38 St & 8 Ave,Subscriber,Male,1977.0,17,Monday,April
299996,3418509,2017-04-28 12:02:00,2017-04-28 12:19:00,994,W 27 St & 7 Ave,W 52 St & 5 Ave,Subscriber,Male,1967.0,12,Friday,April
299997,5034995,2017-05-31 09:11:00,2017-05-31 09:24:00,785,3 Ave & E 72 St,W 44 St & 5 Ave,Subscriber,Male,1972.0,9,Wednesday,May
299998,78227,2017-01-05 08:31:00,2017-01-05 08:51:00,1164,Columbia St & Kane St,Barclay St & Church St,Subscriber,Male,1964.0,8,Thursday,January
299999,2554332,2017-04-09 17:46:00,2017-04-09 18:06:00,1189,Division St & Bowery,Lafayette St & Jersey St,Subscriber,Female,1985.0,17,Sunday,April

In [31]:
newyork.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      299308 non-null  object
 7   gender         270791 non-null  object
 8   birth year     271780 non-null  float64
 9   hour           300000 non-null  int32
 10  day            300000 non-null  object
 11  month          300000 non-null  object
dtypes: datetime64[ns](2), float64(1), int32(1), int64(2), object(6)
memory usage: 26.3+ MB

In [32]:
chicago.gender = chicago.gender.astype('category')
chicago['user type'] = chicago['user type'].astype('category')

newyork.gender = newyork.gender.astype('category')
newyork['user type'] = newyork['user type'].astype('category')

washington['user type'] = washington['user type'].astype('category')

In [33]:
# extract the time in 12 hour clock to new columns

for data in Data:
    data['st date'] = data['start time'].dt.date.astype('datetime64')
    data['en date'] = data['end time'].dt.date.astype('datetime64')
    data['st time'] = data['start time'].dt.strftime('%I:%M:%S')
    data['en time'] = data['end time'].dt.strftime('%I:%M:%S')

In [34]:
chicago.head()

,id,start time,end time,trip duration,start station,end station,user type,gender,birth year,hour,day,month,st date,en date,st time,en time
0,1423854,2017-06-23 15:09:00,2017-06-23 15:14:00,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,15,Friday,June,2017-06-23,2017-06-23,03:09:00,03:14:00
1,955915,2017-05-25 18:19:00,2017-05-25 18:45:00,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,18,Thursday,May,2017-05-25,2017-05-25,06:19:00,06:45:00
2,9031,2017-01-04 08:27:00,2017-01-04 08:34:00,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,8,Wednesday,January,2017-01-04,2017-01-04,08:27:00,08:34:00
3,304487,2017-03-06 13:49:00,2017-03-06 13:55:00,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0,13,Monday,March,2017-03-06,2017-03-06,01:49:00,01:55:00
4,45207,2017-01-17 14:53:00,2017-01-17 15:02:00,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,14,Tuesday,January,2017-01-17,2017-01-17,02:53:00,03:02:00

In [35]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             300000 non-null  int64
 1   start time     300000 non-null  datetime64[ns]
 2   end time       300000 non-null  datetime64[ns]
 3   trip duration  300000 non-null  int64
 4   start station  300000 non-null  object
 5   end station    300000 non-null  object
 6   user type      300000 non-null  category
 7   gender         238948 non-null  category
 8   birth year     238981 non-null  float64
 9   hour           300000 non-null  int32
 10  day            300000 non-null  object
 11  month          300000 non-null  object
 12  st date        300000 non-null  datetime64[ns]
 13  en date        300000 non-null  datetime64[ns]
 14  st time        300000 non-null  object
 15  en time        300000 non-null  object
dtypes: category(2), datetime64[ns](4), float64(1), int32(1), int64(2), object(6)
memory usage: 31.5+ MB

In [36]:
# How to drop any Columns

#1 chicago.drop(columns =['start time'], inplace=True)
#2 chicago.drop(['start time'], axis=1, inplace=True)

for data in Data:
    data.drop(['start time', 'end time'], axis=1, inplace=True)

In [37]:
for data in Data:
    data['st time'] = pd.to_timedelta(data['st time'])
    data['en time'] = pd.to_timedelta(data['en time'])

In [38]:
chicago.head()

,id,trip duration,start station,end station,user type,gender,birth year,hour,day,month,st date,en date,st time,en time
0,1423854,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,15,Friday,June,2017-06-23,2017-06-23,0 days 03:09:00,0 days 03:14:00
1,955915,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,18,Thursday,May,2017-05-25,2017-05-25,0 days 06:19:00,0 days 06:45:00
2,9031,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,8,Wednesday,January,2017-01-04,2017-01-04,0 days 08:27:00,0 days 08:34:00
3,304487,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0,13,Monday,March,2017-03-06,2017-03-06,0 days 01:49:00,0 days 01:55:00
4,45207,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,14,Tuesday,January,2017-01-17,2017-01-17,0 days 02:53:00,0 days 03:02:00

In [39]:
# What is the period of time between start time to end time?

for data in Data:
    data['period of time'] = data['en time'] - data['st time']

In [40]:
chicago.head()

,id,trip duration,start station,end station,user type,gender,birth year,hour,day,month,st date,en date,st time,en time,period of time
0,1423854,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,15,Friday,June,2017-06-23,2017-06-23,0 days 03:09:00,0 days 03:14:00,0 days 00:05:00
1,955915,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,18,Thursday,May,2017-05-25,2017-05-25,0 days 06:19:00,0 days 06:45:00,0 days 00:26:00
2,9031,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,8,Wednesday,January,2017-01-04,2017-01-04,0 days 08:27:00,0 days 08:34:00,0 days 00:07:00
3,304487,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0,13,Monday,March,2017-03-06,2017-03-06,0 days 01:49:00,0 days 01:55:00,0 days 00:06:00
4,45207,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,14,Tuesday,January,2017-01-17,2017-01-17,0 days 02:53:00,0 days 03:02:00,0 days 00:09:00

In [41]:
newyork.head()

,id,trip duration,start station,end station,user type,gender,birth year,hour,day,month,st date,en date,st time,en time,period of time
0,5688089,795,Suffolk St & Stanton St,W Broadway & Spring St,Subscriber,Male,1998.0,14,Sunday,June,2017-06-11,2017-06-11,0 days 02:55:00,0 days 03:08:00,0 days 00:13:00
1,4096714,692,Lexington Ave & E 63 St,1 Ave & E 78 St,Subscriber,Male,1981.0,15,Thursday,May,2017-05-11,2017-05-11,0 days 03:30:00,0 days 03:41:00,0 days 00:11:00
2,2173887,1325,1 Pl & Clinton St,Henry St & Degraw St,Subscriber,Male,1987.0,13,Wednesday,March,2017-03-29,2017-03-29,0 days 01:26:00,0 days 01:48:00,0 days 00:22:00
3,3945638,703,Barrow St & Hudson St,W 20 St & 8 Ave,Subscriber,Female,1986.0,19,Monday,May,2017-05-08,2017-05-08,0 days 07:47:00,0 days 07:59:00,0 days 00:12:00
4,6208972,329,1 Ave & E 44 St,E 53 St & 3 Ave,Subscriber,Male,1992.0,7,Wednesday,June,2017-06-21,2017-06-21,0 days 07:49:00,0 days 07:54:00,0 days 00:05:00

In [42]:
washington.head()

,id,trip duration,start station,end station,user type,hour,day,month,st date,en date,st time,en time,period of time
0,1621326,489.066,14th & Belmont St NW,15th & K St NW,Subscriber,8,Wednesday,June,2017-06-21,2017-06-21,0 days 08:36:34,0 days 08:44:43,0 days 00:08:09
1,482740,402.549,Yuma St & Tenley Circle NW,Connecticut Ave & Yuma St NW,Subscriber,10,Saturday,March,2017-03-11,2017-03-11,0 days 10:40:00,0 days 10:46:00,0 days 00:06:00
2,1330037,637.251,17th St & Massachusetts Ave NW,5th & K St NW,Subscriber,1,Tuesday,May,2017-05-30,2017-05-30,0 days 01:02:59,0 days 01:13:37,0 days 00:10:38
3,665458,1827.341,Constitution Ave & 2nd St NW/DOL,M St & Pennsylvania Ave NW,Customer,7,Sunday,April,2017-04-02,2017-04-02,0 days 07:48:35,0 days 08:19:03,0 days 00:30:28
4,1481135,1549.427,Henry Bacon Dr & Lincoln Memorial Circle NW,Maine Ave & 7th St SW,Subscriber,8,Saturday,June,2017-06-10,2017-06-10,0 days 08:36:28,0 days 09:02:17,0 days 00:25:49

In [43]:
washington['trip duration'] = washington['trip duration'].astype(int)
washington.head()

,id,trip duration,start station,end station,user type,hour,day,month,st date,en date,st time,en time,period of time
0,1621326,489,14th & Belmont St NW,15th & K St NW,Subscriber,8,Wednesday,June,2017-06-21,2017-06-21,0 days 08:36:34,0 days 08:44:43,0 days 00:08:09
1,482740,402,Yuma St & Tenley Circle NW,Connecticut Ave & Yuma St NW,Subscriber,10,Saturday,March,2017-03-11,2017-03-11,0 days 10:40:00,0 days 10:46:00,0 days 00:06:00
2,1330037,637,17th St & Massachusetts Ave NW,5th & K St NW,Subscriber,1,Tuesday,May,2017-05-30,2017-05-30,0 days 01:02:59,0 days 01:13:37,0 days 00:10:38
3,665458,1827,Constitution Ave & 2nd St NW/DOL,M St & Pennsylvania Ave NW,Customer,7,Sunday,April,2017-04-02,2017-04-02,0 days 07:48:35,0 days 08:19:03,0 days 00:30:28
4,1481135,1549,Henry Bacon Dr & Lincoln Memorial Circle NW,Maine Ave & 7th St SW,Subscriber,8,Saturday,June,2017-06-10,2017-06-10,0 days 08:36:28,0 days 09:02:17,0 days 00:25:49

In [44]:
for data, dataname in zip(Data, Dataname):
    print(f'The Null Values for {str(dataname)} is \n{data.isna().sum()}')
    print('---------------------------------')

The Null Values for chicago is
id                    0
trip duration         0
start station         0
end station           0
user type             0
gender            61052
birth year        61019
hour                  0
day                   0
month                 0
st date               0
en date               0
st time               0
en time               0
period of time        0
dtype: int64
---------------------------------
The Null Values for newyork is
id                    0
trip duration         0
start station         0
end station           0
user type           692
gender            29209
birth year        28220
hour                  0
day                   0
month                 0
st date               0
en date               0
st time               0
en time               0
period of time        0
dtype: int64
---------------------------------
The Null Values for washington is
id                0
trip duration     0
start station     0
end station       0
user type         0
hour              0
day               0
month             0
st date           0
en date           0
st time           0
en time           0
period of time    0
dtype: int64
---------------------------------

In [45]:
for data in Data:
    data = data.set_index('id', inplace=True)

In [46]:
chicago.head()

,trip duration,start station,end station,user type,gender,birth year,hour,day,month,st date,en date,st time,en time,period of time
id,,,,,,,,,,,,,,
1423854,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,15,Friday,June,2017-06-23,2017-06-23,0 days 03:09:00,0 days 03:14:00,0 days 00:05:00
955915,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,18,Thursday,May,2017-05-25,2017-05-25,0 days 06:19:00,0 days 06:45:00,0 days 00:26:00
9031,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,8,Wednesday,January,2017-01-04,2017-01-04,0 days 08:27:00,0 days 08:34:00,0 days 00:07:00
304487,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0,13,Monday,March,2017-03-06,2017-03-06,0 days 01:49:00,0 days 01:55:00,0 days 00:06:00
45207,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,14,Tuesday,January,2017-01-17,2017-01-17,0 days 02:53:00,0 days 03:02:00,0 days 00:09:00

In [47]:
chicago['month'].value_counts().sort_values(ascending=False)

June        98081
May         66755
April       51659
February    32057
March       29639
January     21809
Name: month, dtype: int64

In [48]:
newyork['month'].value_counts().sort_values(ascending=False)

June        76022
May         67015
April       58176
February    34741
March       32164
January     31882
Name: month, dtype: int64

In [49]:
washington['month'].value_counts().sort_values(ascending=False)

June        68339
April       62620
May         58193
March       41863
February    38932
January     30053
Name: month, dtype: int64

-- --
-- --

## Popular times of travel

- most common month
- most common day of week
- most common hour of day

 ##### Compute the most popular of the Month

In [50]:
for data, dataname in zip(Data, Dataname):
    comm_month = data['month'].mode()[0]
    print(f'The Common Month  in {dataname}, Is: ({comm_month})')

The Common Month  in chicago, Is: (June)
The Common Month  in newyork, Is: (June)
The Common Month  in washington, Is: (June)

 ##### Compute the most popular of the Day

In [51]:
for data, dataname in zip(Data, Dataname):
    comm_day = data['day'].mode()[0]
    print(f'The Common Day of Week in {dataname}, Is: ({comm_day})')

The Common Day of Week in chicago, Is: (Tuesday)
The Common Day of Week in newyork, Is: (Wednesday)
The Common Day of Week in washington, Is: (Wednesday)

 ##### Compute the most popular of Hour

In [52]:
for data, dataname in zip(Data, Dataname):
    comm_hour = data['hour'].mode()[0]
    print(f'The Common Hour in {dataname}, Is: ({comm_hour})')

The Common Hour in chicago, Is: (17)
The Common Hour in newyork, Is: (17)
The Common Hour in washington, Is: (8)

## Popular Station and Trip

- most common start station
- most common end station
- most common trip from start to end (i.e., most frequent combination of start station and end station)

##### Most Common Start Station

In [53]:
for data, dataname in zip(Data, Dataname):
    comm_st_station = data['start station'].mode()[0]
    print(f'The Common of Start Station in {dataname}, Is: ({comm_st_station})')

The Common of Start Station in chicago, Is: (Streeter Dr & Grand Ave)
The Common of Start Station in newyork, Is: (Pershing Square North)
The Common of Start Station in washington, Is: (Columbus Circle / Union Station)

##### Most Common End Station

In [54]:
for data, dataname in zip(Data, Dataname):
    comm_end_station = data['end station'].mode()[0]
    print(f'The Common of End Station in {dataname}, Is: ({comm_end_station})')

The Common of End Station in chicago, Is: (Streeter Dr & Grand Ave)
The Common of End Station in newyork, Is: (Pershing Square North)
The Common of End Station in washington, Is: (Columbus Circle / Union Station)

##### Most Common Trip Duration

In [55]:
for data, dataname in zip(Data, Dataname):
    comm_trip = data['trip duration'].mode()[0]
    print(f'The Common of Trip Duration in {dataname}, Is: ({comm_trip}).')

The Common of Trip Duration in chicago, Is: (364).
The Common of Trip Duration in newyork, Is: (331).
The Common of Trip Duration in washington, Is: (330).

##### Most Common Trip Duration and Start and End Station

In [56]:
for data, dataname in zip(Data, Dataname):
    comm_trip = data['trip duration'].mode()[0]
    comm_st_station = data['start station'].mode()[0]
    comm_en_station = data['end station'].mode()[0]
    print(f'Common Trip Duration in {dataname}, Is: ({comm_trip}). Start & End Station, Is: ({comm_st_station}) To ({comm_en_station}).')

Common Trip Duration in chicago, Is: (364). Start & End Station, Is: (Streeter Dr & Grand Ave) To (Streeter Dr & Grand Ave).
Common Trip Duration in newyork, Is: (331). Start & End Station, Is: (Pershing Square North) To (Pershing Square North).
Common Trip Duration in washington, Is: (330). Start & End Station, Is: (Columbus Circle / Union Station) To (Columbus Circle / Union Station).

##### Most Common Combination of Start to End Station in Chicago

In [57]:
comm_trip_chic = chicago.groupby(['start station','end station']).size().sort_values(ascending=False)
comm_trip_chic.head(1).to_frame()

                                                     0
start station             end station
Lake Shore Dr & Monroe St Streeter Dr & Grand Ave  854

##### Most Common Combination of Start, End Station and Trip Duration

In [58]:
comm_trip_chic = chicago.groupby(['start station','end station', 'trip duration']).size().sort_values(ascending=False)
comm_trip_chic.head(1).to_frame()

                                                                            0
start station                end station                     trip duration
Sheridan Rd & Irving Park Rd Pine Grove Ave & Irving Park Rd 149            7

##### Most Common Combination of Start to End Station in NewYork

In [59]:
comm_trip_new = newyork.groupby(['start station','end station']).size().sort_values(ascending=False)
comm_trip_new.head(1).to_frame()

                                            0
start station     end station
E 7 St & Avenue A Cooper Square & E 7 St  168

##### Most Common Combination of Start to End Station in Washington

In [60]:
comm_trip_wash = washington.groupby(['start station','end station']).size().sort_values(ascending=False)
comm_trip_wash.head(1).to_frame()

                                                       0
start station             end station
Jefferson Dr & 14th St SW Jefferson Dr & 14th St SW  673

## Trip Duration

- Total Travel Time.
- Average Travel Time.

##### Compute Total Travel Time in Chicago

In [61]:
chicago['trip duration'].sum()

280871787

In [62]:
chicago['period of time'].sum()

Timedelta('477 days 19:42:00')

In [63]:
chicago['period of time'].max()

Timedelta('0 days 11:16:00')

In [64]:
chicago['period of time'].sort_values(ascending=False).head()

id
1123568   0 days 11:16:00
1222299   0 days 10:49:00
561315    0 days 10:22:00
16941     0 days 10:21:00
203679    0 days 09:49:00
Name: period of time, dtype: timedelta64[ns]

In [65]:
chicago['period of time'].value_counts().head()

0 days 00:06:00    18902
0 days 00:05:00    18824
0 days 00:07:00    18361
0 days 00:04:00    17150
0 days 00:08:00    17092
Name: period of time, dtype: int64

##### Compute Average Travel Time in Chicago

In [66]:
chicago['trip duration'].mean()

936.23929

In [67]:
chicago['period of time'].mean()

Timedelta('0 days 00:02:17.612400')

##### Compute Total Travel Time in NewYork

In [68]:
newyork['trip duration'].sum()

269905248

In [69]:
newyork['period of time'].sum()

Timedelta('625 days 23:53:00')

In [70]:
newyork['period of time'].max()

Timedelta('0 days 09:35:00')

In [71]:
newyork['period of time'].sort_values(ascending=False).head()

id
3820180   0 days 09:35:00
5802225   0 days 09:31:00
2329905   0 days 09:21:00
5573434   0 days 08:58:00
3490042   0 days 08:42:00
Name: period of time, dtype: timedelta64[ns]

In [72]:
newyork['period of time'].value_counts().head()

0 days 00:06:00    21113
0 days 00:05:00    20693
0 days 00:07:00    20379
0 days 00:08:00    18781
0 days 00:04:00    18265
Name: period of time, dtype: int64

##### Compute Average Travel Time in NewYork

In [73]:
newyork['trip duration'].mean()

899.68416

In [74]:
newyork['period of time'].mean()

Timedelta('0 days 00:03:00.286600')

##### Compute Total Travel Time in Washington

In [75]:
washington['trip duration'].sum()

371034247

In [76]:
washington['period of time'].sum()

Timedelta('352 days 15:36:47')

In [77]:
washington['period of time'].max()

Timedelta('0 days 11:16:08')

In [78]:
washington['period of time'].sort_values(ascending=False).head()

id
1219330   0 days 11:16:08
721613    0 days 10:48:37
1625669   0 days 10:31:31
1133154   0 days 10:15:17
1205182   0 days 10:03:07
Name: period of time, dtype: timedelta64[ns]

In [79]:
washington['period of time'].value_counts().head()

0 days 00:06:00    7729
0 days 00:05:00    7562
0 days 00:07:00    7468
0 days 00:04:00    6976
0 days 00:08:00    6929
Name: period of time, dtype: int64

##### Compute Average Travel Time in Washington

In [80]:
washington['trip duration'].mean()

1236.7808233333333

In [81]:
washington['period of time'].mean()

Timedelta('0 days 00:01:41.563356666')

## User Info

- Counts of Each User Type.
- Counts of Each Gender (only available in Chicago & NYC).
- Earliest, Most Recently, Most Common Year of Birth (only available in Chicago & NYC).

##### Counts of Each User Type

In [82]:
for data, dataname in zip(Data, Dataname):
    cou_user = data['user type'].value_counts()
    print(f'Counts of each User in {dataname}, Is: \n{cou_user}.')
    print('-'*30)

Counts of each User in chicago, Is:
Subscriber    238889
Customer       61110
Dependent          1
Name: user type, dtype: int64.
------------------------------
Counts of each User in newyork, Is:
Subscriber    269149
Customer       30159
Name: user type, dtype: int64.
------------------------------
Counts of each User in washington, Is:
Subscriber    220786
Customer       79214
Name: user type, dtype: int64.
------------------------------

In [83]:
chicago[chicago['user type'] == 'Dependent']

,trip duration,start station,end station,user type,gender,birth year,hour,day,month,st date,en date,st time,en time,period of time
id,,,,,,,,,,,,,,
195860,311,Emerald Ave & 28th St,Halsted St & Archer Ave,Dependent,Male,1979.0,7,Saturday,February,2017-02-18,2017-02-18,0 days 07:47:00,0 days 07:52:00,0 days 00:05:00

##### Counts of Each Gender (only available in Chicago & NYC)

In [84]:
cou_chic_gender = chicago['gender'].value_counts()
cou_chic_gender

Male      181190
Female     57758
Name: gender, dtype: int64

In [85]:
cou_new_gender = newyork['gender'].value_counts()
cou_new_gender

Male      204008
Female     66783
Name: gender, dtype: int64

#### Earliest, Most Recently, Most Common Year of Birth (only available in Chicago & NYC)

###### Most Earliest Year of Birth

In [86]:
chicago['birth year'].min()

1899.0

In [87]:
newyork['birth year'].min()

1885.0

###### Most Recently Year of Birth

In [88]:
chicago['birth year'].max()

2016.0

In [89]:
newyork['birth year'].max()

2001.0

###### Most Common Year of Birth

In [90]:
chicago['birth year'].mode()[0]

1989.0

In [91]:
newyork['birth year'].mode()[0]

1989.0